%灰色关联分析法
clc,clear;
w = xlsread("第1题A题-附件3.xlsx");
w1 = w(1:15,5:11);      %个人成果数据
w2 = max(w1,[],1);      %母数列
w3 =zeros(15,7);    %归一化的个人成果数据
for i=1:15
    if (max(w1(i,:))-min(w1(i,:)))~=0
        w3(i,:) = (w1(i,:)-min(w1(i,:)))/(max(w1(i,:))-min(w1(i,:)));
    else
        w3(i,:) = 0;
    end
end
t=w2-w1;
mmin =min(min(t));
mmax = max(max(t));
rho = 0.5; %分辨系数
xishu = (mmin+rho*mmax)./(t+rho*mmax);
xd=xishu.*w3;
for i=1:7
    w4(i)=sum(xd(:,i));
end
for i=1:7
    w5(i) = w4(i)/sum(w4);      %各项成果权重
end
writematrix(w5,'w3.xlsx')
%计算个人成果得分
c=w5.*w1;       
c1=sum(c,2);    %个人的成果得分
c2 = [c1(1:5,1)';     % 分组
    c1(6:10,1)';
    c1(11:15,1)'];

%每组得分
c3(1) = sum(c1(1:5,1));
c3(2) = sum(c1(6:10,1));
c3(3) = sum(c1(11:15,1));

c4=sum(c3);%全体总得分

mo=[40000,15000,15000,10000,25000;40000,15000,15000,25000,25000;
    10000,10000,40000,15000,15000]; %个人绩效基数
mo1 =[320000,100000,100000,20000,200000;320000,100000,100000,200000,200000;
    20000,20000,320000,100000,100000];%个人分配经费指标
mo3 = [w(1:5,4)';
    w(6:10,4)';
    w(11:15,4)'];       %横向到账资金

%个人绩效 单位（万元）
c5=c2./c4*10;       %个人成果奖金
mo2=mo3.*mo./mo1;       %个人横向到账资金绩效
mo4 = mo2+c5;           %个人绩效
writematrix(mo4,'g1.xlsx')


%每组总绩效
%每个人的绩效相加得到
% m(1) = sum(mo4(1,:));
% m(2) = sum(mo4(2,:));
% m(3) = sum(mo4(3,:));

%按照经费额度和成果得分分配给同组人员，
% 根据每组总经费额度，成果得分和组内平均个人绩效进行计算
m(1)=sum(mo(1,:))*sum(mo3(1,:))/sum(mo1(1,:))/7+c3(1)*10/c4;
m(2)=sum(mo(2,:))*sum(mo3(2,:))/sum(mo1(2,:))/7+c3(2)*10/c4;
m(3)=sum(mo(3,:))*sum(mo3(3,:))/sum(mo1(3,:))/7+c3(3)*10/c4;

[s,id]=sort(m,2,"descend");
disp(id);
disp(m);
writematrix(m,'g2.xlsx')




